{
  "de": [
    {
      "title": "Wer ich bin",
      "heading": "Axel Herrmann",
      "text": [
        " - wer ist das? Momentan bin ich ein 21-jähriger Student an der Universität Stuttgart im Studiengang Software Engineering B.Sc., der seine Bachelorthesis schreibt. Doch meine Geschichte mit Informatik beginnt viel früher, denn ich konnte mich schon früh für Informatik begeistern.",
        "Bereits in der 7. Klasse hat mein Vater mir einen Online-Blog über Java gezeigt, durch den ich meine ersten Zeilen Java Code geschrieben habe. In der 10 Klasse hatte ich dann erstmals die Chance, Informatikunterricht zu besuchen und es hat sich schnell als mein absolutes Lieblingsfach herausgestellt. Immer auf der Suche nach echten Aufgaben, bei denen ich programmieren kann, habe ich 2018 mit Freunden am #IoT Hackthon meiner Schule teilgenommen und anschließend als einziger Schüler die Möglichkeit bekommen, an der Verwaltungssoftware für das Schulprojekt Schule als Staat (SaS) mit meinem Informatik Lehrer zu entwickeln.",
        "Bestärkt durch die ersten praktischen Erfahrungen habe ich direkt nach meinem Abitur 2020 an der Universität Stuttgart angefangen, Software Engineering zu studieren. Die Inhalte des Studiums haben mich in den meisten Fällen sehr interessiert, wodurch ich oft gemerkt habe, dass mir der Großteil sehr leicht fällt. Besonders viel Spaß haben mir dabei immer die Module gemacht, bei denen ich programmieren konnte.",
        "Um mehr Bezug zur Praxis zu haben und Erfahrung zu sammeln, suchte ich mir bereits im 3. Semester meines Studiums eine Werkstudentenstelle. So bin ich bei levigo solutions gelandet, wo ich ab Beginn 2022 1,5 Jahre am Produkt jadice flow mitentwickelt habe. Hier konnte ich erste Erfahrungen mit renommierten Technologien wie Docker und Kubernetes sammeln und hatte viel Spaß bei der Arbeit."
      ]
    },
    {
      "title": "Softskills",
      "heading": "Arbeit mit mir",
      "text": [
        "<br>Bei meiner Arbeit zeichnet mich vor allem eines aus: meine Motivation und mein Spaß an der Sache. Bisher habe ich noch keine Aufgabe in der Softwareentwicklung gefunden, die mir keinen Spaß gemacht hat. Ich liebe es, mich in neue Technologien, Programmiersprachen & Frameworks einzuarbeiten. Und wenn mir etwas Spaß macht, dann bin ich sehr ehrgeizig, eine Lösung dafür zu finden.",
        "Generell habe ich den Anspruch, Lösungen nicht einfach nur irgendwie zum Laufen zu bringen, sondern die jeweiligen Best Practices anzuwenden. Es fasziniert mich, schöne Lösungen für Probleme zu finden. Ich habe den Anspruch an mich selbst, dass mein Code einfach zu verstehen, gut strukturiert und leicht erweiterbar ist. Dabei tendiere ich manchmal zu Perfektionismus - da muss ich mich selbst bremsen, was ich in der Vergangenheit immer mehr gelernt habe.",
        "Diese Webseite ist ein gutes Beispiel für diese Eigenschaften. Ausgehend von dem Wunsch nach einem dynamischeren Lebenslauf, als es eine PDF-Datei bieten kann, wollte ich eine Website dafür programmieren. Zu diesem Zweck wählte ich Angular, eines der bekanntesten SPA-Frameworks, mit dem ich zu Beginn nicht vertraut war. Dann habe ich mich entschieden, ein Template für diese Webseite Open-Source anzubieten, weshalb der Code eine sehr gute Strukturierung und Trennung von Webseiten-Daten und Webseiten-Logik erfordert. Seitdem habe ich mehrere hundert Stunden an diesem Projekt gearbeitet.",
        "Was die Zusammenarbeit mit Kollegen betrifft, würde ich mich aufgrund meiner relativ offenen Art als guten Teamplayer bezeichnen. In den 3- bis 5-Personen-Projekten während meines Studiums konnte ich mich immer gut einbringen und meinen Partnern oft helfen."
      ]
    }
  ],
  "en": [
    {
      "title": "Who I am",
      "heading": "Axel Herrmann",
      "text": [
        " - who is this? I am currently a 21-year-old Software Engineering B.Sc. student at the University of Stuttgart, writing my bachelor's thesis. But my history with computer science begins much earlier, because I was enthusiastic about computer science from an early age.",
        "Back in 7th grade, my father showed me an online blog about Java, through which I wrote my first lines of Java code. In the 10th grade, I had the chance to attend computer science classes for the first time and it quickly turned out to be my absolute favorite subject. Always on the lookout for real tasks where I could program, I took part in my school's #IoT Hackthon with friends in 2018 and subsequently got the opportunity to be the only student to develop the management software for the school project School as State (SaS) with my computer science teacher.",
        "Encouraged by my first practical experiences, I started studying Software Engineering at the University of Stuttgart straight after graduating from high school in 2020. I was very interested in most of the content of the course, which often made me realize that I found most of it very easy. I always particularly enjoyed the modules where I was able to program.",
        "In order to gain more practical experience, I looked for a working student position in the 3rd semester of my studies. That's how I ended up at levigo solutions, where I helped develop the jadice flow product for 1.5 years from the start of 2022. Here I was able to gain my first experience with renowned technologies such as Docker and Kubernetes and had a lot of fun at work."
      ]
    },
    {
      "title": "Softskills",
      "heading": "Working with me",
      "text": [
        "<br>In my work, I am characterized by one thing above all: my motivation and my enjoyment of what I do. So far, I haven't found a task in software development that I haven't enjoyed. I love familiarizing myself with new technologies, programming languages and frameworks. And if I enjoy something, then I am very ambitious to find a solution for it.",
        "In general, I don't just want to make solutions work somehow, but to apply the respective best practices. I am fascinated by finding beautiful solutions to problems. I demand of myself that my code is easy to understand, well structured and easy to extend. Sometimes I tend to be a perfectionist - I have to slow myself down, which I have learned more and more in the past.",
        "This website is a good example of these features. Based on the desire for a more dynamic CV than a PDF file can offer, I wanted to program a website for it. For this purpose, I chose Angular, one of the most popular SPA frameworks, which I was not familiar with at the beginning. Then I decided to open-source a template for this website, which is why the code requires very good structuring and separation of website data and website logic. Since then, I have spent several hundred hours working on this project.",
        "As far as working with colleagues is concerned, I would describe myself as a good team player due to my relatively open nature. In the 3 to 5-person projects during my studies, I was always able to contribute well and often help my partners."
      ]
    }
  ]
}
